Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: If Unicode (for example, C<\N{}> or code points of 0x100 or beyond) is being used, the case map used by C<\l>, C<\L>, C<\u>, and C<\U> is as defined by Unicode.
es_es: Si se usa Unicode (por ejemplo, C<\N{}> o códigos de punto de 0x100 o superiores), el mapeo de tamaño de caja usado por C<\l>, C<\L>, C<\u> y C<\U> está definido por Unicode.

source: Comments start with a hash symbol and run to the end of the line
es_es: Los comentarios comienzan con un símbolo # y van hasta el final de la línea:

source: This document describes various features of FreeBSD that will affect how Perl version 5 (hereafter just Perl) is compiled and/or runs.
es_es: Este documentos describe varias características de FreeBSD que afectarán a cómo Perl versión 5 (de ahora en adelante sólo Perl) es compilado y/o ejecutado.

source: Most platforms store signed integers in two's-complement notation, so usually this is not an issue.
es_es: La mayoría de las plataformas almacenan enteros con signo en notación de complemento a dos, así que por lo general esto no es ningún problema.

source: If you're using strict, you I<must not> declare $a and $b as lexicals.
es_es: Si está usando strict, I<no debe> declarar $a y $b como léxicas.

source: for (my $i = 0; $i < @ary1; $i++) {
es_es: for (my $i = 0; $i < @array1; $i++) {

source: For more detail on looping constructs (and some that weren't mentioned in this overview) see L<perlsyn>.
es_es: Para obtener más información sobre las estructuras de bucle (y otras estructuras que no se han mencionado en esta introducción), consulte L<perlsyn>.

source: The terminator of this construct is found using the same rules as for finding the terminator of a C<{}>-delimited construct, the only exception being that C<]> immediately following C<[> is treated as though preceded by a backslash.
es_es: El terminador de esta construcción es encontrado usando las mismas reglas que para encontrar el terminador de la construcción delimitada por llaves, C<{}>, con la única excepción de que C<]> inmediatamente después de un C<[> es tratado como si estuviera precedido por una barra invertida.

source: Too late for "-T" option has been changed to the more informative
es_es: Demasiado tarde para la opción "-T" se ha cambiado para que sea más informativa

# print "True " if $array[$index];
source: print "True\n" if $array[$index];
es_es: print "Verdadero\n" if $array[$index];

source: unpack("W/a", "\004Gurusamy") gives ("Guru")
es_es: unpack("W/a", "\004Gurusamy") da ("Guru")

source: . Match any character (except newline)
es_es: . Coincide con cualquier carácter (excepto el nueva línea)

source: The match-once behavior is controlled by the match delimiter being C<?>; with any other delimiter this is the normal C<m//> operator.
es_es: El comportamiento de la coincidencia de una sola vez, es controlada por el delimitador que comienza por C<?>; con cualquier otro delimitador, se trata del habitual operador C<m//>.

source: # more flexible:
es_es: # más flexible:

source: For certain applications, the catch and throw pair of C<eval{}> and die() for exception processing can also be a prudent approach.
es_es: Para ciertas aplicaciones, la pareja C<eval{}> y C<die()> puede ser un prudente planteamiento para el procesamiento de excepciones.

source: to list some (not all may be available simultaneously), or it may be read I<as is>: as F<README.dgux>.
es_es: por listar algunos (no todos pueden estar disponibles simultáneamente), o puede ser leído I<tal cual>: como F<README.dgux>.

source: This document attempts to describe the Perl Community's "best practice" for writing Perl modules.
es_es: Este documento intenta describir las "mejores prácticas" de la Comunidad Perl para la escritura de módulos Perl.

source: After preprocessing described above, and possibly after evaluation if concatenation, joining, casing translation, or metaquoting are involved, the resulting I<string> is passed to the RE engine for compilation.
es_es: Después del proceso previo descrito anteriormente, y posiblemente después de la evaluación si la concatenación, unión, traducción de tamaño de caja, o metaentrecomillado están involucrados, el I<string> resultante es pasado al motor de RE para su compilación.

source: API should be understandable by the average programmer
es_es: La API debe ser comprensible para un programador medio

source: # The following are compatibility aliases for S_IRUSR, S_IWUSR, S_IXUSR.
es_es: # Los siguientes son los alias de compatibilidad para S_IRUSR, S_IWUSR, S_IXUSR.

source: The C<until> statement executes the block as long as the expression is false.
es_es: La instrucción C<until> ejecuta el bloque mientras la expresión sea falsa.

source: Now much more picky about extra or missing output from test scripts.
es_es: Ahora es mucho más exigente con la salida extra o con la que falta de los scripts de test.

source: Each programmer will, of course, have his or her own preferences in regards to formatting, but there are some general guidelines that will make your programs easier to read, understand, and maintain.
es_es: Cada programador tendrá, naturalmente, sus propias preferencias con respecto al estilo, pero hay algunas directrices que harán sus programas más fáciles de leer, entender y mantener.

source: C<XSLoader> is now used for faster loading
es_es: Ahora se usa C<XSLoader> para acelerar la carga

source: Precisely which areas are good and bad is often a personal choice, so asking this question on Usenet runs a strong risk of starting an unproductive Holy War.
es_es: Precisamente las áreas en las que es bueno o malo suelen ser una opción personal, por lo que hacer esta pregunta en Usenet conlleva un riesgo elevado de iniciar una guerra santa inútil.

source: However, in scalar context the operator returns the next value each time it's called, or C<undef> when the list has run out.
es_es: Sin embargo, en contexto escalar el operador devuelve el siguiente valor cada vez que se le llama, o C<undef> cuando la lista se ha agotado.

source: \o{}, \000 character whose ordinal is the given octal number
es_es: \o{}, \000 carácter cuyo ordinal es el número octal indicado

source: VMS: waitpid enhancements
es_es: VMS: mejoras en waitpid

source: When the types of data form a natural hierarchy that can make use of inheritance
es_es: Cuando los tipos de datos forman una jerarquía natural que puede hacer uso de la herencia

source: On systems that don't support fchmod(2), passing filehandles raises an exception.
es_es: En sistemas que no admiten fchmod(2), pasarle un identificador de archivo lanza una excepción.

source: nonassoc named unary operators
es_es: no asoc. operadores unarios nombrados

source: =head2 Declarations X<declaration> X<undef> X<undefined> X<uninitialized>
es_es: =head2 Declaraciones X<declaration> X<undef> X<undefined> X<uninitialized> X<declaración> X<indefinido> X<no inicializado>

source: Checks if the expression has been evaluated inside of recursion.
es_es: Comprueba si la expresión se ha evaluado en el interior de la recursión.

source: Except at the end of a string, having fewer than two valid digits will result in a warning.
es_es: Salvo en el final de una cadena, con menos de dos dígitos válidos, dará lugar a una advertencia.

source: Passing only one of the first two elements as C<undef> is equivalent to passing a 0 and will not have the effect described when both are C<undef>.
es_es: Pasando solo uno de los dos primeros elementos como C<undef> es equivalente a pasar un 0 y no tendrá el efecto descrito cuando ambos son C<undef>.

source: if (!open(FOO)) { die "Can't open $FOO: $!"; }
es_es: if (!open(FOO)) { die "No puedo abrir $FOO: $!"; }

source: push @files, $File::Find::fullname
es_es: push @archivos, $File::Find::fullname

source: Unlike most locales, which are specific to a language and country pair, Unicode classifies all the characters that are letters I<somewhere> as C<\w>.
es_es: A diferencia de la mayoría de las configuraciones regionales, que son específicas de un de un idioma y de un país, Unicode clasifica todos los caracteres que son letras, I<en cualquier parte>, como C<\w>.

source: =item select FILEHANDLE X<select> X<filehandle, default>
es_es: =item select IDENTIFICADOR_ARCHIVO X<select> X<filehandle, default> X<identificador de archivo, por defecto>

source: open(ARTICLE, "-|", "caesar <$article") # decrypt article
es_es: open(ARTICULO, "-|", "caesar <$articulo") # decodificar el artículo

source: Top of form processing is handled automatically: if there is insufficient room on the current page for the formatted record, the page is advanced by writing a form feed, a special top-of-page format is used to format the new page header before the record is written.
es_es: El procesado del comienzo del formulario se maneja de forma automática: si no hay suficiente espacio en la página actual para el registro formateado, la página se desplaza escribiendo un avance de página; un formato especial de principio de página es utilizado entonces para dar formato al encabezado de la nueva página antes de que el registro sea escrito.

source: In this way C<our> differs from C<use vars>, which is package-scoped.
es_es: De esta manera, C<our> difiere de C<use vars>, en que su ámbito es el paquete.

source: Perl under Mac OS Classic has not been supported since before Perl 5.10 (April 2004).
es_es: Perl bajo Mac OS Classic no está soportado desde antes de Perl 5.10 (April 2004).

source: perlcommunity Perl community information
es_es: perlcommunity Información sobre la comunidad Perl

source: Has semantics similar to the following subroutine:
es_es: Tiene una semántica similar a la subrutina siguiente:

source: CPAN contains source code, non-native ports, documentation, scripts, and many third-party modules and extensions, designed for everything from commercial database interfaces to keyboard/screen control to web walking and CGI scripts.
es_es: En CPAN puede encontrar código fuente, adaptaciones a plataformas no nativas, documentación, scripts y muchos módulos y extensiones de terceros, diseñados para todo tipo de aplicaciones, como interfaces de bases de datos comerciales, control de pantalla y teclado, exploración automática de sitios web y creación de scripts CGI.

source: If VARIABLE is a hash, it chops the hash's values, but not its keys.
es_es: Si VARIABLE es un hash, recorta los valores del hash, pero no sus claves.

source: - left-justify within the field
es_es: - justifica a la izquierda dentro del campo

source: $ end of string
es_es: $ final de una cadena

source: In addition, several special variables that provide windows into the inner working of Perl have names containing punctuation characters and control characters.
es_es: Además, ciertas variables especiales que proporcionan acceso al medio interno de Perl tienen nombres que contienen caracteres de puntuación y caracteres de control.

source: C<goto &> is now more robust - bugs in deep recursion and chained C<goto &> have been fixed.
es_es: C<goto &> es ahora más robusto - errores en la recursividad profunda y C<goto &> encadenados han sido corregidos.

source: Copyright (c) 1997-2010 Tom Christiansen, Nathan Torkington, and other authors as noted.
es_es: Copyright (c) 1997-2010 Tom Christiansen, Nathan Torkington y otros autores indicados.

source: Always returns the undefined value.
es_es: Siempre devuelve el valor indefinido.

source: See L<perlsyn/"Switch statements"> for detailed information.
es_es: Ver L<perlsyn/"Instrucciones Switch"> para obtener información detallada.

source: This latter is useful for counting characters in a class or for squashing character sequences in a class.
es_es: Esto último es útil para el recuento de caracteres de una clase o para reducir las secuencias de caracteres de una clase.

source: See also the C<Term::ReadKey> module from your nearest CPAN site; details on CPAN can be found under L<perlmodlib/CPAN>.
es_es: Ver también el módulo C<Term::ReadKey> en su sitio CPAN más cercano; detalles sobre CPAN se pueden encontrar en L<perlmodlib/CPAN>.

source: Some bugs have been fixed in the hash internals.
es_es: Algunos errores han sido corregidos en los procedimientos internos de los hash.

source: If you understand this rule, you may skip the rest of this section on the first reading.
es_es: Si usted entiende esta regla, puede omitir la primera lectura del resto de esta sección.

source: =head2 Generic fixes
es_es: =head2 Arreglos genéricos

source: If the right side is either a C<[...]>, C<{...}>, or a C<(...)> subscript, then the left side must be either a hard or symbolic reference to an array, a hash, or a subroutine respectively.
es_es: Si el lado derecho es, o una C<[...]>, C<{...}>, o un subrango C<(...)>, entonces el lado izquierdo debe ser una referencia dura o simbólica a un array, un hash, o una subrutina, respectivamente.

source: B<WARNING>: Once Perl sees that you need one of C<$&>, C<$`>, or C<$'> anywhere in the program, it has to provide them for every pattern match.
es_es: B<ADVERTENCIA>: Una vez que Perl considera que necesitas una de C<$&>, C<$`>, o C<$'>, en cualquier parte del programa, las usará para todos los patrones de coincidencia.

source: =head2 List Operators (Rightward) X<operator, list, rightward> X<list operator>
es_es: =head2 Operadores de lista (por la derecha) X<operator, list, rightward> X<list operator> X<operador, lista, por la derecha> X<operador de lista>

source: by Richard Foley with Andy Lester
es_es: Richard Foley con Andy Lester

source: C<our> associates a simple name with a package variable in the current package for use within the current scope.
es_es: C<our> asocia un nombre sencillo con una variable de paquete en el paquete actual para ser usado en el ámbito actual.

source: If SECONDS is not specified, the value stored in C<$_> is used.
es_es: Si no se ha especificado SEGUNDOS, se usará el valor almacenado en C<$_>.

source: June 1, 2000
es_es: 1 de junio 2000

source: Floating-point numbers are only approximations to what a mathematician would call real numbers.
es_es: Números de punto flotante son sólo aproximaciones a lo que un matemático llamaría a los números reales.

source: The build system that Perl uses is called metaconfig. This system is maintained separately from the Perl core.
es_es: Perl usa un sistema de compilación denominado metaconfig. El mantenimiento de este sistema se realiza por separado del mantenimiento del núcleo de Perl.

source: Note that C<chop> returns the last character.
es_es: Note que C<chop> devuelve el último carácter.

source: If the output is empty and C<$@> already contains a value (typically from a previous eval) that value is used after appending C<"\t...caught"> to C<$@>.
es_es: Si la salida está vacía y C<$@> ya contiene un valor (típicamente de un eval() anterior) este valor es utilizado después de añadirle C<"\t...caught">.

source: That means it actually has both compile-time and run-time effects.
es_es: Esto significa que tiene efectos tanto en tiempo de compilación como en tiempo de ejecución.

source: You should have received a copy of the Artistic License with this Kit, in the file named "Artistic".
es_es: Debería haber recibido una copia de la Licencia Artística con este kit, en el archivo denominado "Artistic".

source: s/foo/bar/; # replaces foo with bar in $_
es_es: s/foo/bar/; # reemplaza foo por bar en $_

source: \d [3] Match a decimal digit character
es_es: \d [3] Coincide con un dígito

source: perl51310delta Perl changes in version 5.13.10
es_es: perl51310delta Cambios en la versión 5.13.10

source: # search for some stuff and put it into files
es_es: # buscar por algo y ponerlo en el archivo

source: POS must be a value returned by C<telldir>.
es_es: POS debe ser un valor devuelto por C<telldir>.

source: Opens a socket of the specified kind and attaches it to filehandle SOCKET.
es_es: Abre un socket de la clase especificada y lo adhiere al identificador de archivo SOCKET.

# print "Even " if ($x & 1) == 0;
source: print "Even\n" if ($x & 1) == 0;
es_es: print "Par\n" if ($x & 1) == 0;

source: (You can use C<for my $_ (@array)>.)
es_es: (Puede usar C<for my $_ (@array)>.)

source: A coderef is now acceptable for C<CHECK>!
es_es: ¡Ahora se acepta una referencia a código en C<CHECK>!

source: s Squash duplicate replaced characters.
es_es: s Elimina caracteres duplicados.

source: Also, if many elements may be undefined you may see the following unattractive method calls:
es_es: Además, si muchos elementos pueden estar indefinidos puede ver las siguientes poco atractivas llamadas de métodos:

source: @ARRAY = (); # completely empty @ARRAY
es_es: @ARRAY = (); # vaciar completamente @ARRAY

source: The following equivalences hold (assuming C<< $[ == 0 and $#a >= $i >> )
es_es: Las siguientes equivalencias se mantienen (suponiendo que C<< $[ == 0 y $#a >= $i >> )

source: C<ptardiff> is a small script used to generate a diff between the contents of a tar archive and a directory tree.
es_es: C<ptardiff> es una pequeña utilidad que genera las diferencias entre los contenidos de un archivo tar y un árbol de directorio.

source: There are many, many code points, but computers work with bytes, and a byte has room for only 256 values.
es_es: Hay muchísimos códigos de carácter, pero el hardware trabaja con bytes, y un byte sólo puede representar 256 valores.

source: opendir(D, $dir) or die "can't opendir $dir: $!";
es_es: opendir(D, $dir) or die "no puedo hacer opendir $dir: $!";

source: prints
es_es: imprime

source: This document describes how Perl internally handles numeric values.
es_es: En este documento se describe el procesamiento interno de valores numéricos en Perl.

source: Values are usually referred to by name, or through a named reference.
es_es: A los valores se accede normalmente por su nombre, o a través de una referencia con nombre.

source: Specifying it twice gives added protection.
es_es: Especificándolo dos veces ofrece una protección adicional.

source: Also, this has to unwind one hash and build a whole new one, which may take some time on a large hash, such as from a DBM file.
es_es: Además, esto tiene el efecto de desmontar un hash y construir uno nuevo, algo que puede tardar algún tiempo en un hash grande, como en un archivo DBM.

source: (However, C<defined @$foo> and C<defined %$foo> are still allowed.
es_es: (Sin embargo, C<defined @$foo> y C<defined %$foo> todavía están permitidos.

source: Braces are required in referring to named capture groups, but are optional for absolute or relative numbered ones.
es_es: Las llaves son necesarias al referirse a los grupos de captura de llamada, pero son opcionales para los números absolutos o relativos.

source: The caller is responsible for incrementing the reference count of the array returned if it wants to keep the structure.
es_es: El llamador es responsable de incrementar el contador de referencias del array devuelto si se quiere mantener la estructura.

source: Returns the arctangent of Y/X in the range -PI to PI.
es_es: Devuelve el arcotangente de Y/X en el rango -PI a PI.

source: sub myopen {
es_es: sub miopen {

source: =item Verbs without an argument
es_es: =item Verbos sin argumento

source: The previous assignments are exactly equivalent to
es_es: Las asignaciones anteriores son exactamente iguales a

source: You may otherwise modify your copy of this Package in any way, provided that you insert a prominent notice in each changed file stating how and when you changed that file, and provided that you do at least ONE of the following:
es_es: De lo contrario puede modificar su copia de este Paquete de cualquier manera, siempre que se inserte de forma visible en cada archivo cambiado, indicando cómo y cuándo se ha cambiado ese archivo, y siempre que usted haga por lo menos UNO de los puntos siguientes:

source: =head2 IRIX: t/uni/tr_7jis.t falsely failing
es_es: =head2 IRIX: t/uni/tr_7jis.t falla falsamente

source: @foo = grep {!/^#/} @bar; # weed out comments
es_es: @foo = grep {!/^#/} @bar; # quitar los comentarios

source: No, Perl is easy to start learning--and easy to keep learning.
es_es: No. Es fácil adquirir los conocimientos básicos; y también lo es seguir aprendiendo.

source: Described in L<perlmod>, L<perlmodlib>, and L<perlmodinstall>.
es_es: Se describe en L<perlmod>, L<perlmodlib> y L<perlmodinstall>.

source: <> is just a synonym for <ARGV>, which is magical.
es_es: <> es justo un sinónimo de <ARGV>, lo cual es mágico.

source: In decimal representation this is close to 16 decimal digits and decimal exponents in the range of -304..304.
es_es: En representación decimal, estos límites se acercan a 16 dígitos decimales y exponentes decimales en el intervalo -304..304.

source: It's a lexical pragma, like C<strict> or C<warnings>.
es_es: Se trata de una pragma léxico, al igual que C<strict> o C<warnings>.

source: Array Array arrays are comparable[2]
es_es: Array Array arrays son comparables[2]

source: =head2 Where do I send bug reports?
es_es: =head2 ¿A qué dirección debo enviar los informes de error?

source: SPLICE this, offset, length, LIST
es_es: SPLICE este, desplazamiento, longitud, LISTA

source: If EXPR is omitted, returns the log of C<$_>.
es_es: Si EXPR se omite, devuelve el logaritmo de C<$_>.

source: As before, the rules to determine where the C<code> ends are currently somewhat convoluted.
es_es: Como antes, las reglas para determinar el lugar donde C<código> termina son algo enrevesadas.

source: =head2 Assignment Operators X<assignment> X<operator, assignment> X<=> X<**=> X<+=> X<*=> X<&=> X<<< <<= >>> X<&&=> X<-=> X</=> X<|=> X<<< >>= >>> X<||=> X<//=> X<.=> X<%=> X<^=> X<x=>
es_es: =head2 Operadores de asignación X<assignment> X<operator, assignment> X<=> X<**=> X<+=> X<*=> X<&=> X<<< <<= >>> X<&&=> X<-=> X</=> X<|=> X<<< >>= >>> X<||=> X<//=> X<.=> X<%=> X<^=> X<x=> X<asignación> X<operador, asignación>

source: You'll probably have to say
es_es: Probablemente escribirá

source: This step is the last one for all constructs except regular expressions, which are processed further.
es_es: Este paso es el último para todas las construcciones, salvo las expresiones regulares, que son procesadas ulteriormente.

source: The error "Can't locate Foo.pm in @INC" now lists the contents of @INC for easier debugging.
es_es: El error "Can't locate Foo.pm in @INC" ahora lista los contenidos de @INC para una depuración más sencilla

source: =head2 I copied the perl binary from one machine to another, but scripts don't work.
es_es: =head2 He copiado el binario perl de una máquina a otra, pero los scripts no funcionan.

source: See L<SelfLoader> for more description of __DATA__, and an example of its use.
es_es: Ver L<Autocargador> para una mayor descripción de __DATA__, y ejemplos de su uso.

source: The exact meaning of the $gcos field varies but it usually contains the real name of the user (as opposed to the login name) and other information pertaining to the user.
es_es: El significado exacto del campo $gcos varía pero usualmente contiene el nombre real del usuario (como opuesto al nombre de login) y otra información perteneciente al usuario.

source: This means for example that C<$version{2.0}++> is equivalent to C<$version{2}++>, not to C<$version{'2.0'}++>.
es_es: Esto significa, por ejemplo, que C<$version{2.0}++> es equivalente a C<$version{2}++>, no a C<$version{'2.0'}++>.

source: Don't require every module user to jump through the same hoops to achieve a simple result.
es_es: No exija a cada usuario del módulo saltar a través de los mismos aros para lograr un resultado sencillo.
